---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidAttrThicknessParam
source: html/efdfee51-dd8f-afce-09dd-31f817ed8ecd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidAttrThicknessParam Property

"Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidAttrThicknessParam { get; }
```